[{"type":"div","childs":[{"type":"h3","childs":[{"type":"text","text":"Now here’s the strange part"}]},{"type":"p","childs":[{"type":"text","text":"Since this spiked my curiosity, I asked around. And found out that in his spare time outside of work he goes and works his own projects that he’s actually passionate about."}]},{"type":"p","childs":[{"type":"text","text":"So, during the day, when he’s getting paid to code, he is watching YouTube videos about things nobody really cares about, wastes hours of his life he will never get back, and wastes his employer’s money."}]},{"type":"p","childs":[{"type":"text","text":"And when the day is over and he’s back home, he then starts actual coding and productive work, in an environment he controls, and with minimal distractions."}]},{"type":"h3","childs":[{"type":"text","text":"Coincidence?"}]},{"type":"p","childs":[{"type":"text","text":"I think not. The workplace is currently the worst place to actually do work!"}]},{"type":"p","childs":[{"type":"text","text":"After working in an environment that doesn’t allow you to focus for too long, your brain becomes used to not being focused, and it affects your cognitive and creative abilities, leading to worse work, and costing your employers a lot of money."}]},{"type":"p","childs":[{"type":"text","text":"In fact, according to The Telegraph:"}]},{"type":"blockquote","childs":[{"type":"text","text":"Office distractions cost employers up to 3 hours per day, this is 60 hours per month."}]},{"type":"p","childs":[{"type":"text","text":"This study was not done with software engineers in mind, so I expect the data for software engineers to be even more shocking."}]},{"type":"p","childs":[{"type":"text","text":"Let’s do the math and see how much these distractions cost you:"}]},{"type":"p","childs":[{"type":"text","text":"20 engineers at 30€ per hour = 20*60*30 = 36,000€"}]},{"type":"p","childs":[{"type":"text","text":"36,000€ wasted, per month! And that’s assuming these 3 hours are realistic for software development. Which, as a software developer myself, I can tell you is not the case."}]},{"type":"h3","childs":[{"type":"text","text":"What’s the solution?"}]},{"type":"p","childs":[{"type":"text","text":"Well, realizing there’s a problem is the first step. Many companies either don’t realize or don’t care."}]},{"type":"p","childs":[{"type":"text","text":"Having a heart-to-heart conversation with employees is the next one, I have been through this before in previous leadership roles, and all the answers I got were the following:"}]},{"type":"ul","childs":[{"type":"li","childs":[{"type":"text","text":"More flexible schedules"}]},{"type":"li","childs":[{"type":"text","text":"More home office"}]}]},{"type":"p","childs":[{"type":"text","text":"Depending on the environment at your company, you may not get honest answers. People are complex, group dynamics are even more complex, and as a boss/leader, your authority changes the group dynamics whenever you’re in the room."}]},{"type":"p","childs":[{"type":"text","text":"But I guarantee you, if you’re not offering very flexible schedules and home office, you’re literally throwing money away."}]},{"type":"p","childs":[{"type":"text","text":"I understand the fear about allowing home office, but if you can measure your productivity with an accurate metric(tip: lines of code is not an accurate metric). You can see if it improves or not, and with a proper strategy it will always improve."}]},{"type":"p","childs":[{"type":"text","text":"This is an incomplete solution. I would love to hear your opinions in the comments!"}]}]}]